EDT/УТ/src/Catalogs/новаТранспорт/новаТранспорт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>новаТранспорт</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ВнешняяМаршрутизация</name>
      <description>Внешняя маршрутизация</description>
    </items>
  </predefined>
  <attributes>
    <name>Вид</name>
    <type>
      <types>CatalogRef.новаВидыТранспорта</types>
    </type>
  </attributes>
  <attributes>
    <name>Марка</name>
    <type>
      <types>CatalogRef.новаМаркиТранспорта</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерГосударственнойРегистрации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Грузоподъемность</name>
    <comment>В тоннах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВысотаКузова</name>
    <comment>В метрах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаКузова</name>
    <comment>В метрах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГлубинаКузова</name>
    <comment>В метрах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемКузова</name>
    <comment>В кубических метрах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.новаКонтрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ГаражныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолнаяВысотаКузова</name>
    <comment>В метрах (используется для ограничений прохождения по улицам)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.новаСклады</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВыбранныхКатегорий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВыбранныхРайонов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вместимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойВодитель</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойГараж</name>
    <type>
      <types>CatalogRef.новаГаражи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКузова</name>
    <type>
      <types>CatalogRef.новаТипыКузовов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособЗагрузки</name>
    <type>
      <types>CatalogRef.новаСпособыЗагрузки</types>
    </type>
  </attributes>
  <attributes>
    <name>Пропуск</name>
    <type>
      <types>CatalogRef.новаТипыПропусков</types>
    </type>
  </attributes>
  <attributes>
    <name>Лифт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Манипулятор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СанитарныйПаспорт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РайонСтоянки</name>
    <type>
      <types>CatalogRef.новаГеоРайоны</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПрицепа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойБак</name>
    <type>
      <types>CatalogRef.новаБакиТранспорта</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндивидуальныеНормы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СобственныйВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КатегорииТранспортаСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>90</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЛог</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаёмныйТранспорт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БезМобильногоПриложения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТранспорта</name>
    <type>
      <types>CatalogRef.ТипыТранспортаДляЛогистики</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаЗаКилометр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальнаяСкорость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТерминалДоставки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Префикс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийОператорМаршрутизации</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КатегорииТранспорта</name>
    <attributes>
      <name>ЗначениеКатегории</name>
      <type>
        <types>CatalogRef.новаЗначенияКатегорийТранспорта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Районы</name>
    <attributes>
      <name>Район</name>
      <type>
        <types>CatalogRef.новаГеоРайоны</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/УТ/src/InformationRegisters/ДополнительныеПараметрыТранспорта/ДополнительныеПараметрыТранспорта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДополнительныеПараметрыТранспорта</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>УдаленноеЗакрытиеРейсов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РежимПечатиЧеков</name>
    <type>
      <types>EnumRef.ВариантыПечатиЧековРМЭкипажа</types>
    </type>
  </resources>
  <resources>
    <name>МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОсновнаяРольТранспорта</name>
    <type>
      <types>CatalogRef.РолиТранспорта</types>
    </type>
  </resources>
  <resources>
    <name>КассовыйСервер</name>
    <type>
      <types>ExchangePlanRef.ОбменСКассовымСервером</types>
    </type>
  </resources>
  <resources>
    <name>ФорматАвтотранспорта</name>
    <type>
      <types>CatalogRef.ФорматыАвтотранспорта</types>
    </type>
  </resources>
  <resources>
    <name>ЭтоШтатныйТранспорт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/ПланируемыеКатегорииЗаказовТранспорта/ПланируемыеКатегорииЗаказовТранспорта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПланируемыеКатегорииЗаказовТранспорта</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>КатегорияУчитывается</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СхемаЛогистическихБрейков</name>
    <type>
      <types>CatalogRef.СхемыЛогистическихБрейков</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗаказа</name>
    <type>
      <types>EnumRef.ТипыЗаказов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Категория</name>
    <type>
      <types>CatalogRef.ЛогистическиеБрейки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Enums/ВариантыПечатиЧековРМЭкипажа/ВариантыПечатиЧековРМЭкипажа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыПечатиЧековРМЭкипажа</name>
  <enumValues>
    <name>НеПечататьЧек</name>
  </enumValues>
  <enumValues>
    <name>ПечататьЧекНаСервереККМ</name>
  </enumValues>
  <enumValues>
    <name>ПечататьЧекНаМобильномПринтере</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Catalogs/новаТранспорт/Forms/ФормаЭлементаУпр/Module.bsl
&НаКлиенте
Перем лДопНастройки_ПечататьЧекНаСервереККМ;

&НаКлиенте
Перем лДопНастройки_УдаленноеЗакрытиеРейсов;

&НаКлиенте
Перем лДопНастройки_МаксимальноеКоличествоЗаказовПМ;

&НаКлиенте
Перем лДопНастройки_ОсновнаяРольТранспорта;

&НаКлиенте
Перем лДопНастройки_ФорматАвтотранспорта;

&НаКлиенте
Перем лДопНастройки_ЭтоШтатныйТранспорт;

&НаСервере
Процедура ЗаполнитьРеквизитыДопПараметров()
	Зап = Новый Запрос;
	Зап.Текст = 
	"ВЫБРАТЬ
	|	ДополнительныеПараметрыТранспортаСрезПоследних.Период КАК Период,
	|	ДополнительныеПараметрыТранспортаСрезПоследних.УдаленноеЗакрытиеРейсов КАК УдаленноеЗакрытиеРейсов,
	|	ВЫБОР
	|		КОГДА ДополнительныеПараметрыТранспортаСрезПоследних.РежимПечатиЧеков = ЗНАЧЕНИЕ(Перечисление.ВариантыПечатиЧековРМЭкипажа.ПечататьЧекНаСервереККМ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РежимПечатиЧеков,
	|	ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации КАК МаксимальноеКоличествоЗаказовПМ,
	|	ДополнительныеПараметрыТранспортаСрезПоследних.ОсновнаяРольТранспорта КАК ОсновнаяРольТранспорта,
	|	ДополнительныеПараметрыТранспортаСрезПоследних.ФорматАвтотранспорта КАК ФорматАвтотранспорта,
	|	ДополнительныеПараметрыТранспортаСрезПоследних.ЭтоШтатныйТранспорт КАК ЭтоШтатныйТранспорт
	|ИЗ
	|	РегистрСведений.ДополнительныеПараметрыТранспорта.СрезПоследних(, Транспорт = &Транспорт) КАК ДополнительныеПараметрыТранспортаСрезПоследних";
	Зап.УстановитьПараметр("Транспорт", Объект.Ссылка);
	
	Выб = Зап.Выполнить().Выбрать();
	
	Пока Выб.Следующий() Цикл
		ДопНастройки_ДатаСведений = Выб.Период;
		ДопНастройки_ПечататьЧекНаСервереККМ = Выб.РежимПечатиЧеков;
		
		ДопНастройки_УдаленноеЗакрытиеРейсов = Выб.УдаленноеЗакрытиеРейсов;
		ДопНастройки_МаксимальноеКоличествоЗаказовПМ = Выб.МаксимальноеКоличествоЗаказовПМ;
		ДопНастройки_ОсновнаяРольТранспорта = Выб.ОсновнаяРольТранспорта;
		ДопНастройки_ФорматАвтотранспорта = Выб.ФорматАвтотранспорта;
		ДопНастройки_ЭтоШтатныйТранспорт = Выб.ЭтоШтатныйТранспорт;
	КонецЦикла;
	
	Если Не ДопНастройки_ЭтоШтатныйТранспорт Тогда
		Элементы.ДопНастройки_ФорматАвтотранспорта.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры	


&НаКлиенте
Процедура ЗаполнитьПромежуточныеЗначения()
 	лДопНастройки_ПечататьЧекНаСервереККМ = ДопНастройки_ПечататьЧекНаСервереККМ;
 	лДопНастройки_УдаленноеЗакрытиеРейсов = ДопНастройки_УдаленноеЗакрытиеРейсов;
	лДопНастройки_МаксимальноеКоличествоЗаказовПМ = ДопНастройки_МаксимальноеКоличествоЗаказовПМ;
	лДопНастройки_ОсновнаяРольТранспорта = ДопНастройки_ОсновнаяРольТранспорта;
	лДопНастройки_ФорматАвтотранспорта = ДопНастройки_ФорматАвтотранспорта;
	лДопНастройки_ЭтоШтатныйТранспорт = ДопНастройки_ЭтоШтатныйТранспорт;
КонецПроцедуры	

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Вставить содержимое обработчика.
	ЗаполнитьРеквизитыДопПараметров();
	ЗаполнитьДанныеКатегорийПоУмолчанию();	
	
	УстановкаФильтраАктивныхКатегорий();
	УправлениеДиалогом();
	ЗаполнитьПромежуточныеЗначения();
КонецПроцедуры

&НаКлиенте
Процедура УправлениеДиалогом()
	Если Объект.БезМобильногоПриложения Тогда
		Элементы.ДопНастройки_ПечататьЧекНаСервереККМ.Доступность = Ложь;
		Элементы.ДопНастройки_УдаленноеЗакрытиеРейсов.Доступность = Ложь;
	Иначе
		Элементы.ДопНастройки_ПечататьЧекНаСервереККМ.Доступность = Истина;
		Элементы.ДопНастройки_УдаленноеЗакрытиеРейсов.Доступность = Истина;		
	КонецеСли;	
КонецПроцедуры	

&НаКлиенте
Процедура ЗаписатьДанныеДопПараметровНаКлиенте()
	ЕСли лДопНастройки_ПечататьЧекНаСервереККМ = ДопНастройки_ПечататьЧекНаСервереККМ И 
		лДопНастройки_УдаленноеЗакрытиеРейсов = ДопНастройки_УдаленноеЗакрытиеРейсов И
		лДопНастройки_МаксимальноеКоличествоЗаказовПМ = ДопНастройки_МаксимальноеКоличествоЗаказовПМ И
		лДопНастройки_ОсновнаяРольТранспорта = ДопНастройки_ОсновнаяРольТранспорта И
		лДопНастройки_ФорматАвтотранспорта = ДопНастройки_ФорматАвтотранспорта И
		лДопНастройки_ЭтоШтатныйТранспорт = ДопНастройки_ЭтоШтатныйТранспорт Тогда
	    Возврат;
	КонецеСли;	
	ЗаписатьДанныеДопПараметров();
КонецПроцедуры	
	
	

&НаСервере
Процедура ЗаписатьДанныеДопПараметров()
	
	ТекД = ТекущаяДата();
	
	Наб = РегистрыСведений.ДополнительныеПараметрыТранспорта.СоздатьНаборЗаписей();
	Наб.Отбор.Период.Установить(ТекД);
	Наб.Отбор.Транспорт.Установить(Объект.Ссылка);
	
	Нов = Наб.Добавить();
	
	Нов.Период = ТекД;
	Нов.Транспорт = Объект.Ссылка;
	Нов.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации = ДопНастройки_МаксимальноеКоличествоЗаказовПМ;
	Если ДопНастройки_ПечататьЧекНаСервереККМ Тогда
		Нов.РежимПечатиЧеков = Перечисления.ВариантыПечатиЧековРМЭкипажа.ПечататьЧекНаСервереККМ;
	Иначе	
		Нов.РежимПечатиЧеков = Перечисления.ВариантыПечатиЧековРМЭкипажа.НеПечататьЧек;
	КонецеСли;	
	Нов.УдаленноеЗакрытиеРейсов = ДопНастройки_УдаленноеЗакрытиеРейсов;
	Нов.ОсновнаяРольТранспорта = ДопНастройки_ОсновнаяРольТранспорта;
	Нов.ФорматАвтотранспорта = ДопНастройки_ФорматАвтотранспорта;
	Нов.ЭтоШтатныйТранспорт = ДопНастройки_ЭтоШтатныйТранспорт;
	
	Наб.Записать();
КонецПроцедуры	


&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// Вставить содержимое обработчика.
	//ЗаписатьДанныеДопПараметров();
	ЗаписатьКатегорииПоумолчанию();
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	// Вставить содержимое обработчика.
	ЗаписатьДанныеДопПараметровНаКлиенте()
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьМассивСтруктурДанныхПМ(Транспорт, СхемаКатегорий)
	СхемаКатегорий = МаршрутизацияЗаказовСервер.ОпределитьАктуальнуюСхемуЛогистическихБрейков();
	
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	ПланируемыеКатегорииЗаказовТранспортаСрезПоследних.Категория КАК Категория,
	            |	ПланируемыеКатегорииЗаказовТранспортаСрезПоследних.КатегорияУчитывается КАК Актуален,
	            |	ПланируемыеКатегорииЗаказовТранспортаСрезПоследних.ТипЗаказа КАК ТипЗаказа
	            |ИЗ
	            |	РегистрСведений.ПланируемыеКатегорииЗаказовТранспорта.СрезПоследних(
	            |			,
	            |			Транспорт = &Транспорт
	            |				И СхемаЛогистическихБрейков = &СхемаЛогистическихБрейков) КАК ПланируемыеКатегорииЗаказовТранспортаСрезПоследних";
	Зап.УстановитьПараметр("Транспорт", Транспорт);
	Зап.УстановитьПараметр("СхемаЛогистическихБрейков", СхемаКатегорий);
	МасЗначений = Новый массив;
	
	Выб = Зап.Выполнить().Выбрать();
	
	Пока Выб.Следующий() Цикл
		Струк = Новый Структура;
		Струк.Вставить("Категория", Выб.Категория);
		Струк.Вставить("Актуален", Выб.Актуален);
		Струк.Вставить("ТипЗаказа", Выб.ТипЗаказа);
		
		МасЗначений.Добавить(Струк);
	КонецЦикла;	
	
	Возврат МасЗначений;
КонецФункции	

&НаКлиенте
Процедура ЗаполнитьДанныеКатегорийПоУмолчанию()
	
	МассивСтруктур = ПолучитьМассивСтруктурДанныхПМ(Объект.Ссылка, СхемаКатегорий);
	ТаблицаКатегорий.Очистить();
	
	Для Каждого Тек Из МассивСтруктур Цикл
		Нов = ТаблицаКатегорий.Добавить();
		ЗаполнитьЗначенияСвойств(Нов, Тек);
		Нов.ЗаполненоИзБД = Истина;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКатегорийПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура УстановкаФильтраАктивныхКатегорий()
	Элементы.ТаблицаКатегорийОтборАктивныхКатегорий.Пометка = Не Элементы.ТаблицаКатегорийОтборАктивныхКатегорий.Пометка;
	
	Если Элементы.ТаблицаКатегорийОтборАктивныхКатегорий.Пометка Тогда
		ФМ = Новый ФиксированнаяСтруктура("Актуален", Истина);
		Элементы.ТаблицаКатегорий.ОтборСтрок = ФМ;
	Иначе
		Элементы.ТаблицаКатегорий.ОтборСтрок = Неопределено;
	КонецеСли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ОтборАктивныхКатегорий(Команда)
	// Вставить содержимое обработчика.
	УстановкаФильтраАктивныхКатегорий();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКатегорийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Копирование Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьКатегорииПоумолчанию()
	
	Наб = Неопределено;
	
	Для Каждого Тек Из ТаблицаКатегорий Цикл
		Если Не Тек.Модифицировано Тогда
			Продолжить;
		КонецеСли;	
		
		Наб = РегистрыСведений.ПланируемыеКатегорииЗаказовТранспорта.СоздатьНаборЗаписей();
		ТекД = ТекущаяДата();
		Наб.Отбор.Период.Установить(ТекД);
		Наб.Отбор.Транспорт.Установить(Объект.Ссылка);
		Наб.Отбор.Категория.Установить(Тек.Категория);
		
		Нов = Наб.Добавить();
		Нов.Период = ТекД;
		Нов.Транспорт = Объект.Ссылка;
		Нов.КатегорияУчитывается = Тек.Актуален;
		Нов.Пользователь = ПараметрыСеанса.ТекущийПользователь;
		Нов.СхемаЛогистическихБрейков = СхемаКатегорий;
		Нов.Категория = Тек.Категория;
		Нов.ТипЗаказа = Тек.ТипЗаказа;
		
		Наб.Записать();

	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКатегорийПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Элементы.ТаблицаКатегорий.ТекущиеДанные.Модифицировано = Истина;
	Если НоваяСтрока Тогда
		Элементы.ТаблицаКатегорий.ТекущиеДанные.Актуален = Истина;
	КонецеСли;	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКатегорийКатегорияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Струк = Новый Структура;
	Струк.Вставить("СхемаБрейков", СхемаКатегорий);
	Струк.Вставить("Транспорт", Объект.Ссылка);
	Ф = ОткрытьФорму("Справочник.ЛогистическиеБрейки.Форма.ФормаВыбора", Струк, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если Не ИсточникВыбора.Элементы.Список.ТекущиеДанные.УжеПривязано Тогда
		Элементы.ТаблицаКатегорий.ТекущиеДанные.Категория = ВыбранноеЗначение;
		Если ЗначениеЗаполнено(Элементы.ТаблицаКатегорий.ТекущиеДанные.Категория) Тогда
			Элементы.ТаблицаКатегорий.ТекущиеДанные.ТипЗаказа = Элементы.ТаблицаКатегорий.ТекущиеДанные.Категория.ТипЗаказа;
			Если Не ЗначениеЗаполнено(Элементы.ТаблицаКатегорий.ТекущиеДанные.ТипЗаказа) Тогда
				Сообщить("На карточке категории не установлен тип заказа!");
				Элементы.ТаблицаКатегорий.ТекущиеДанные.Категория = "";
			КонецеСли;				
		КонецеСли;	
	КонецеСли;	
КонецПроцедуры

&НаКлиенте
Процедура БезМобильногоПриложенияПриИзменении(Элемент)
	УправлениеДиалогом();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДополнительныеПараметрыТранспортаСрезПоследних.КассовыйСервер КАК КассовыйСервер
	               |ИЗ
	               |	РегистрСведений.ДополнительныеПараметрыТранспорта.СрезПоследних(, Транспорт = &ГруппаТранспорта) КАК ДополнительныеПараметрыТранспортаСрезПоследних";
	Запрос.УстановитьПараметр("ГруппаТранспорта",Объект.Родитель);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		КассовыйСервер = Выборка.КассовыйСервер;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ДопНастройки_ЭтоШтатныйТранспортПриИзменении(Элемент)
	
	Элементы.ДопНастройки_ФорматАвтотранспорта.ТолькоПросмотр = Не ДопНастройки_ЭтоШтатныйТранспорт;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ДопНастройки_ЭтоШтатныйТранспорт И ДопНастройки_ФорматАвтотранспорта.Пустая() Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле ""Формат автотранспорта"" не заполнено",,"ДопНастройки_ФорматАвтотранспорта",, Отказ);
	КонецЕсли;
	
КонецПроцедуры
